num = int(input("ციფრი: "))
if num < 10:
    print("თქვენი ციფრი არის 10-ზე ნაკლები")
else:
    print("თქვენი ციფრი 10-ის ტოლია ან 10-ზე მეტია")
print("----------")

num = int(input("ციფრი: "))
if num % 2 == 0:
    print("თქვენი ციფრი არის ლუწი")
else:
    print("თქვენი ციფრი კენტია")

print("----------")

num = int(input("ციფრი: "))

if num > -1:
    print("თქვენი ციფრი დადებითა")
elif num <= -1:
    print("თქვენი ციფრი დადებითი არ არის")

print("----------")

num = int(input("ციფრი: "))
num2 = int(input("ციფრი: "))

if num == num2:
    print("თქვენი ციფრები ტოლია")
else:
    print("თქვენი ციფრები ტოლია არ არის")

print("----------")

num = int(input("ციფრი: "))

if num > 100:
    if num % 2 == 0:
        print("თქვენი ციფრი მეტია 100-ზე და არის ლუწი")
else:
    print("თქვენი ციფრი არ არის მეტი 100-ზე და არ არის ლუწი")

print("----------")

num = int(input("ციფრი: "))

if num % 10 == 0 and num % 5 ==0:
    print("თქვენი ციფრი არის 5-ის და 10-ის ჯერადი")
else:
    print("თქვენი ციფრი არ არის 5-ის და 10-ის ჯერადი")