num1 = 150
num2 = 100

# შევქმენით ორი ცვლადი num1 და num2 და მივანიჭეთ მნიშვნელობა

sum = num1 - num2
print(sum)

sum = num1 + num2 
print(sum)

sum = num1 * num2
print(sum)

sum = num1 / num2
print(sum)

# შეგვიძლია ცალკე ცვლადში ამ ორი ცვლადის სხვაობა, ჯამი, ნამრავლი და განაყოფი შევინახოთ და ტერმინალში დავპრინტოთ

print("----------------")

სახელი = "ნიკოლოზი"
ასაკი = 13

# ამ შემთხვევაში შევქმენით ცვლადები "სახელი" და "ასაკი" და მივანიჭეთ შესაბამისი მნიშვნელობები

print("ჩემი სახელია" + სახელი + "და ვარ" + str(ასაკი) + "წლის")

# და ამ ორი ცვლადი დახმარებით დავპრინტეთ წინადადება

print("----------------")

points = 50

points = 75

points = 100

points = 150

#python -ი კოდს ხაზებით მიყვება შესაბამისად ცვლადს თუ კიდევ გამოვიყენებთ და სხვა მნიშვნელობას მივანიჭებთ იგი ახალ მნიშვნელობას დაიმახსოვრებს

print(points)

#შესაბამისად დაპრინტვის დროს puthon -ი ცვლადის ახალ მნიშვნელობას დაპრინტავს

print("----------------")

birthyear = 2010
current_year = 2024
year_past = current_year - birthyear

# მე შევქმენი ცვლადები და მივანიჭე ჩემი დაბადების წლის და ახლანდელი წლის მნიშვნელობა შემდეგ ახლდანდელს ჩემი დაბადების წელი გამოვაკელი და მივიღე მათი სხვაობა 

print("ჩემი დაბადების დღიდან გავიდა " + str(year_past) + " " + "წელი")

#შემდეგ ის დავპრინტე   